tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/0/Ydefault.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           $internalField;
    }

    ceiling
    {
        type            fixedValue;
        value           $internalField;
    }

    "(inlet|outlet|leftBoundary|rightBoundary)"
    {
        type            cyclic;
    }
		processor
		{	
				type						processor;
				value						unfirom (0 0 0);
		}
		processorCyclic
		{	
				type						processorCyclic;
				value						unfirom (0 0 0);
		}
		#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
