tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(inlet|outlet|leftBoundary|rightBoundary)"
    {
        type            cyclic;
        value           $internalField;
    }
		#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
