tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          binary;
    class           volScalarField;
    location        "0";
    object          ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    ceiling
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    leftBoundary
    {
        type            cyclic;
    }
    rightBoundary
    {
        type            cyclic;
    }
		#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
