tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/constant/momentumTransport.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
		model						incompressibleKEqn;
		// model						Smagorinsky;
    turbulence      on;

    printCoeffs     on;
		
		delta						cubeRootVol;
}


// ************************************************************************* //
