tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// X   5000;
// Y   5000;
// Z   2000;

X   1000;
Y   1000;
Z   1000;

vertices
(
    (0 0 0)
    ($X 0 0)
    ($X $Y 0)
    (0 $Y 0)
    (0 0 $Z)
    ($X 0 $Z)
    ($X $Y $Z)
    (0 $Y $Z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 64) 
		simpleGrading 
		(
			1
			1
			1
		)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
						(0 3 2 1)
        );
    }
		
    ceiling
    {
        type patch;
        faces
        (
						(4 5 6 7)
        );
    }

		inlet
		{
				type cyclic;
				neighbourPatch outlet;
				faces
				(
            (1 5 4 0)
				);
		}

		outlet
		{
				type cyclic;
				neighbourPatch inlet;
				faces
				(
            (3 7 6 2)
				);
		}

		leftBoundary
		{
				type cyclic;
				neighbourPatch rightBoundary;
				faces
				(
            (0 4 7 3)
				);
		}

		rightBoundary
		{
				type cyclic;
				neighbourPatch leftBoundary;
				faces
				(
            (1 2 6 5)
				);
		}
);

mergePatchPairs
(
);

// ************************************************************************* //
