tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     atmBuoyantMultiphaseEulerPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// q = 200 Wm-2 when t < 7390, then switched to q = -200 Wm-2
endTime					10800;

deltaT          0.5;

writeControl    runTime;

writeInterval   20;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// maxDeltaT			2;

adjustTimeStep  yes;

maxCo           0.6;

// ************************************************************************* //
libs ("libatmosphericTurbulenceModels.so");

functions
{
}
