tutorials/atmBuoyantMultiphasePimpleFoam/stratifiedKolmogorovFlow/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// meanVelocityConstraint
// {
// 		type								meanVelocityForce;
// 
// 		selectionMode				all;
// 
// 		U										U;
// 
// 		Ubar								(0 10.0 0);
// 		relaxationFactor		0.2;
// };

